    


一段

    黄地，多豪杰，以一敌百人不怯。

　　人不怯，仇必雪，看我华夏男儿血。

　　男儿血，自壮烈，豪气贯胸心如铁。

　　手提黄金刀，身佩白玉珏，饥啖美酋头，渴饮罗刹血。

　　儿女情，且抛却，瀚海志，只今决。

　　男儿仗剑行千里，千里一路斩胡羯。

　　爱琴海畔飞战歌，歌歌为我华夏贺。

　　东京城内舞钢刀,刀刀尽染倭奴血。

　　立班超志，守苏武节，歌武穆词，做易水别。

　　落叶萧萧,壮士血热，寒风如刀,悲歌声切。

　　且纵快马过天山，又挽长弓扫库页。

　　铁舰直下悉尼湾,一枪惊破北海夜。

　　西夷运已绝,大汉如中天。

　　拼将十万英雄胆，誓画环球同为华夏色，到其时，共酌洛阳酒，醉明月。

　　男儿行，当暴戾。事与仁，两不立。

　　男儿当杀人，杀人不留情。

　　千秋不朽业，尽在杀人中。

　　昔有豪男儿，义气重然诺。

　　睚眦即杀人，身比鸿毛轻。

　　又有雄与霸，杀人乱如麻，

　　驰骋走天下，只将刀枪夸。

　　今欲觅此类，徒然捞月影。

　　君不见，竖儒蜂起壮士死，神州从此夸仁义。

　　一朝虏夷乱中原，士子豕奔懦民泣。

　　我欲学古风，重振雄豪气。

　　名声同粪土，不屑仁者讥。

　　身佩削铁剑，一怒即杀人。

　　割股相下酒，谈笑鬼神惊。

　　千里杀仇人，愿费十周星。

　　专诸田光俦，与结冥冥情。

　　朝出西门去，暮提人头回。

　　神倦唯思睡，战号蓦然吹。

　　西门别母去，母悲儿不悲。

　　身许汗青事，男儿长不归。

　　杀斗天地间，惨烈惊阴庭。

　　三步杀一人，心停手不停。

　　血流万里浪，尸枕千寻山。

　　壮士征战罢，倦枕敌尸眠。

二段

　　梦中犹杀人，笑靥映素辉。

　　女儿莫相问，男儿凶何甚？

　　古来仁德专害人，道义从来无一真。

　　君不见，狮虎猎物获威名，可怜麋鹿有谁怜？

　　世间从来强食弱，纵使有理也枉然。

　　君休问，男儿自有男儿行。

　　男儿行，当暴戾。事与仁，两不立。

　　男儿事在杀斗场，胆似熊罴目如狼。

　　生若为男即杀人，不教男躯裹女心。

　　男儿从来不恤身，纵死敌手笑相承。

　　仇场战场一百处，处处愿与野草青。

　　男儿莫战栗，有歌与君听：

　　杀一是为罪，屠万是为雄。屠得九百万，即为雄中雄。

　　雄中雄，道不同：

　　看破千年仁义名，但使今生逞雄风。

　　美名不爱爱恶名，杀人百万心不惩。

　　宁教万人切齿恨，不教无有骂我名。

　　放眼世界五千年，何处英雄不杀人？

　　我辈热血好男儿，却能今人输古人？

　　百年复几许？慷慨一何多！

　　子当为我击筑，我为子高歌。

　　招手海边鸥鸟，看我胸中云梦，蒂芥近如何？楚越等闲耳，肝胆有风波。

　　生平事，天付与，且婆娑。

　　几人尘外相视，一笑醉颜酡。

　　看到浮云过了，又恐堂堂岁月，一掷去如梭。

　　劝子且秉烛，为驻好春过。